In [ ]:
# import Libraries
import pandas as pd
import json

In [ ]:
df = pd.read_json("schools-additional.json")

In [ ]:
df

     id                                     school_details  score
0  4533  [{'school': 'Kutama', 'grade_codes': '[3ae, 5f...     95
1  6578  [{'school': 'Kutama', 'grade_codes': '[9tr, 5y...     80
2  9876  [{'school': 'Roosevelt', 'grade_codes': '[4yu,...     87

In [ ]:
# load data using Python JSON module
with open('schools-additional.json','r') as f:
    data = json.loads(f.read())

In [ ]:
df_nested_list = pd.json_normalize(data, record_path =['school_details'],  meta=['id', 'score'])

In [ ]:
df_nested_list

        school      grade_codes  ...    id score
0       Kutama  [3ae, 5fg, 4re]  ...  4533    95
1        Freds  [9gt, 7gh, 6hf]  ...  4533    95
2       Kutama       [9tr, 5yu]  ...  6578    80
3       Mazowe               []  ...  6578    80
4    Roosevelt       [4yu, 8ij]  ...  9876    87
5  St Dominics               []  ...  9876    87
6        Johns               []  ...  9876    87

[7 rows x 8 columns]

In [ ]:
df_nested_list["other_references"]

0                   [main eggs, kitchen, food two]
1    [main eggs, spare wheel, food three, janitor]
2                           [football, 3rd series]
3                                           [None]
4                            [footballs, restroom]
5                                           [None]
6                                           [None]
Name: other_references, dtype: object

In [ ]:
for i, l in enumerate(df_nested_list["other_references"]):
    print("list",i,"is",type(l))

list 0 is <class 'list'>
list 1 is <class 'list'>
list 2 is <class 'list'>
list 3 is <class 'list'>
list 4 is <class 'list'>
list 5 is <class 'list'>
list 6 is <class 'list'>

In [ ]:
def to_1D(series):
 return pd.Series([x for _list in series for x in _list])

all_records = to_1D(df_nested_list["other_references"]).value_counts()
all_records

main eggs      2
kitchen        1
spare wheel    1
restroom       1
3rd series     1
football       1
footballs      1
food three     1
food two       1
janitor        1
dtype: int64

In [ ]:
# What is the average number of "other_references" in all the data
df_nested_list["other_references"].str.len()

0    3
1    4
2    2
3    1
4    2
5    1
6    1
Name: other_references, dtype: int64

In [ ]:
# how many students have only 2 items in their "other_references" list
df_nested_list.loc[df_nested_list["other_references"].str.len() == 2, 'id']

2    6578
4    9876
Name: id, dtype: object

In [ ]:
total = df_nested_list["other_references"].str.len().sum()

In [ ]:
# What percentage of students have 2, or more than 3 items in "other_references". how many have 4 or more?
(((df_nested_list["other_references"].str.len() == 2).sum() / (total)) * 100).sum()

28.57142857142857

In [ ]:
(((df_nested_list["other_references"].str.len() == 3).sum() / (total)) * 100).sum()

14.285714285714285

In [ ]:
(((df_nested_list["other_references"].str.len() == 4) / (total)).sum() * 100).sum()

14.285714285714285

In [ ]:
df_nested_list["meal"] == "lunch"

0     True
1     True
2     True
3     True
4    False
5     True
6    False
Name: meal, dtype: bool

In [ ]:
df_nested_list["meal"]

0     lunch
1     lunch
2     lunch
3     lunch
4    dinner
5     lunch
6    dinner
Name: meal, dtype: object

In [ ]:
df_nested_list['id'].unique()

array(['4533', '6578', '9876'], dtype=object)

In [ ]:
# How many students have "meal":"lunch"?
df_nested_list.loc[df_nested_list["meal"] == "lunch", 'id'].unique()

array(['4533', '6578', '9876'], dtype=object)

In [ ]:
# how many of all records have "meal":"lunch"
lunch = (df_nested_list.loc[df_nested_list["meal"] == "lunch", 'id']).count()
lunch

5

In [ ]:
total = df_nested_list.shape[0]
total

7

In [ ]:
# What percentage are they of the data?
(lunch/total) * 100

71.42857142857143

In [ ]:
#  How many records in total, regardless of which student have more than 2 items in "other_references"?
(df_nested_list["other_references"].str.len() != 2).sum()

5

In [ ]:
# how many records are null in "other_references"?
(df_nested_list["other_references"].str.len() == 1).sum()

3

In [ ]:
# concatenate all items in "other_references"
all_records.sum()

11

In [ ]:
df_nested_list.astype(str)

        school      grade_codes  ...    id score
0       Kutama  [3ae, 5fg, 4re]  ...  4533    95
1        Freds  [9gt, 7gh, 6hf]  ...  4533    95
2       Kutama       [9tr, 5yu]  ...  6578    80
3       Mazowe               []  ...  6578    80
4    Roosevelt       [4yu, 8ij]  ...  9876    87
5  St Dominics               []  ...  9876    87
6        Johns               []  ...  9876    87

[7 rows x 8 columns]

In [ ]:
for i, l in enumerate(df_nested_list["id"]):
    print("list",i,"is",type(l))

list 0 is <class 'str'>
list 1 is <class 'str'>
list 2 is <class 'str'>
list 3 is <class 'str'>
list 4 is <class 'str'>
list 5 is <class 'str'>
list 6 is <class 'str'>

In [ ]:
# what is the average size/length of the resulting strings
x = []
for col in df_nested_list.columns:
  c = df_nested_list[col].tolist()
  x.append(c)
concat_list = [j for i in x for j in i]
len(concat_list)

56